Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: MENURUT IBU,
en: in my opinion,

source: LAH, MALAH LU YANG JADI SEMANGAT, HAHAHA!!
en: you’re the one getting excited now, hahaha!

source: SENDIRI, KARENA
en: I didn’t know what to do

source: YA BUAT
en: take this

source: …MANA SAYA TAU…
en: whatever...

source: YA, DAN.
en: jordan.

source: Gambir.
en: station.

source: SINI LIAT!!!
en: I’ll check!

source: GURU, GAK ADA
en: I won’t let

source: Siapa juga yang mau berantem sama Lo.
en: tsk... as if I’d argue with you.

source: LARAS HARUS
en: she shouldn’t

source: AYO RADI KE SINI!
en: come closer, radi!

source: LAGI?!!!!
en: you doofus?!

source: Dulu nggak ada yang peduli sama keinginan gue, dan hidup seperti apa yang gue mau.
en: back then, nobody really cared about me or what I wanted to do in life.

source: Ku-kuro…?
en: k-kuro?

source: ADA TEMPAT LAIN?!
en: that’s closer!

source: Ya udah pake mobil gue aja nih.
en: let’s just use my car.

source: EH IYA, TEMEN GUE MASIH DI LANTAI ATAS?
en: oh right, is my friend still upstairs?

source: SALAH GUE...
en: this wasn’t my fault...

source: KAPAN?!
en: when?

source: AJA KE STASIUN,
en: you don’t wanna

source: PUNTEN...
en: excuse me...

source: mengantarkan
en: will take

source: TRUS GUE NGUMPET DI RUANGAN, YANG TERNYATA DI RUANGAN ITU ADA BINTANG.
en: after that, I went into hiding in a room, where I met bintang.

source: BURUK BUAT GUE, NGGAK PERLU ADA YANG
en: I didn’t have time to find

source: PENASARAN!
en: to be honest!

source: paan gua dah bilang nginep di studio.
en: didn't I say I'd be spending the night in the studio?

source: BRUGH!
en: thud

source: BERMAKSUD
en: didn’t

source: Umm… ya… mengenal material, bahan, teknik dalam membentuk keramik…
en: well... I learned about the materials and techniques of ceramic making.

source: parahyangan
en: express.

source: BERPACARAN KARENA BERHARAP PASANGAN KITA BISA MEMBUAT KITA JADI LEBIH BAIK, ATAU SEBALIKNYA.
en: ...with the hope that our partners will make us better, or the other way around.

source: EH, MAU NYOBAIN ITU NGGAK?!
en: hey, why don’t we go there?

source: episode 58 Maaf…
en: episode 58 sorry...

source: HAAHH...
en: but still...

source: Saya juga mau Radi fokus sama masa depan Radi, bukan sama saya.
en: I want you to focus on your future, radi, not on me.

source: KAMU KALI INI.
en: thesis!

source: Dia sangat
en: He really likes

source: Daripada saya terjebak di topik yang sama, nantinya malah makin kebingungan.
en: if I keep messing with the wrong topic, I’ll only get confused.

source: ADA PAK
en: was there,

source: GUE CABUT
en: I’m off, okay?

source: LU, KERJAANNYA
en: about you.

source: WAKTU YANG
en: it would

source: LARAAASSS!!!
en: laraaas!!!

source: SOALNYA NGGAK
en: into my study because

source: SAYA DULU KULIAHNYA
en: I didn’t

source: NGENTOT ADA CICAAAKKK!!!!!
en: fuck, a lizarddd!!!

source: BIKIN RUSAK
en: she didn’t want

source: AYU RAYAKAN
en: do them and

source: KAMU PASTI UDAH TAU 'KAN MASALAH LARAS DAN RADI, GIMANA MEREKA TERNYATA BELOM NGELARIN MASALAH MEREKA MASING-MASING.
en: you know what laras and radi’s problems are and how they haven’t been able to solve them, right?

source: SETENGAH MATI,
en: so upset.

source: MEREKA CUMA
en: they’d

source: CIAK...
en: a chick...

source: WUADUH?!!
en: what?!

source: TAPI ‘KAN…
en: but...

source: Ma!
en: mom!

source: KE ATAS AJAAA HAHAHA!
en: just go upstairs, haha!

source: Gue disuapin Larasati Ayudia Kusuma…
en: oh my god! laras is feeding me a macaron--

source: BERANGKAT DARI
en: I was too focused

source: Loh?!
en: huh?!

source: KENAPA NGGAK MINTA TOLONG AJA, YAAMPUN… HAHAHA
en: why didn’t you just ask someone for a hand? hahaha.

source: Sebelum kita bakal jarang ketemu lagi…
en: ...before we become strangers again.

source: maya, di luar sana setelah kamu lulus, kamu akan berhadapan dengan orang lain, kamu nggak akan bisa menyelesaikannya sendiri.
en: maya, you’ll have to deal with other people after you graduate. you will not be able to accomplish everything on your own.

source: CAFE BIAR
en: I opened a cafe so that

source: MASING-MASING DARI
en: however, they would

source: SAYA NGGAK ADA MASALAH SAMA TINGGI BADAN SAYA SELAMA INI…
en: I’ve never had a problem with my height...

source: Tapi gue malah mengacaukan semuanya demi nyari tau soal itu semua, yang berakhir jadi perasaan bersalah…
en: but I’ve messed everything up in order to get the answers, and I feel so guilty.

source: Apaan sih mobil di mana-mana sama aja?!
en: it's exactly the same as any other car!

source: Gak.
en: no!

source: ais, sini dulu.
en: harist, look here.

source: SELAMA INI SAYA
en: I joined

source: KE STASIUN, KAMU
en: to the station,

source: SEMOGA BINTANG DAN LARAS BISA NGELARIN MASALAH MEREKA…
en: I hope bintang and laras will work things out between themselves.

source: LO SIBUK SAMA URUSAN MASING-MASING,
en: I guess you were too occupied,

source: aku merasa... aku bisa nyelametin kamu, semua yang kamu rasain dari dulu sampai sekarang, aku bisa ngegantiin itu semua.
en: I thought I could ease your burden... that I could fix everything that you’ve been going through until now.

source: KAMPUS SAYA SEKARANG
en: and a major

source: JEMPUT MAYA
en: to pick her

source: episode 67 Yang Tersampaikan
en: episode 67 send a message

source: NELPON.
en: called.

source: UMM… IYA… JADI GUE GANTI PENAMPILAN BIAR GAK DIKENALI KITTY AJA SIH…
en: uh... actually... I changed my appearance so that kitty wouldn’t be able to recognize me.

source: DI STASIUN,
en: the station

source: Gue begini karena lo orang yang paling penting banget dalam hidup gue?
en: ...that I’m like this because you are my everything?

source: GUE JELASIN...
en: he’ll

source: YA NAK, JADI
en: thank you so much

source: NIH AKU AMBILIN.
en: here, I got it for you.

source: Itu dia.
en: is that him?

source: seterjal apa pun jalan yang harus saya lalui...
en: no matter how treacherous the path that I must take...

source: SEKOLAH INI UDAH TERLANJUR JADI MEMORI
en: this school had already left a bad taste in my mouth.

source: Kamu tenang aja, Maya.
en: just relax, maya.

source: TEMPATNYA SUSAH
en: you’ll have access

source: AHAHAHA...
en: hahaha...

source: LO MASIH
en: you were

source: DIH NGAPA TUH…
en: what’s with them?

source: TOPIK YANG MAU
en: the topic you’re planning

source: ...TAPI SAYA
en: I got

source: JAUH ITU...
en: too far.

source: Nggak terlalu mepet itu nak? nanti Linda marah-marah lagi lho.
en: are you sure you can make it on time? otherwise, linda’s gonna be furious.

source: MAKSUD GUE,
en: I mean...

source: ternyata baik
en: he was actually quite nice!

source: …Ini ada apa sih sebenarnya?
en: what’s going on?

source: GRUP KAYAK
en: a senior?

source: DIMANA
en: be

source: IKUT GUA DULU YUK, JANJI GAK MALEM-MALEM BANGET!
en: you know what, let’s go somewhere first. I’ll make sure you get home on time.

source: AKHIR INI.
en: mom.

source: UDAH KALO CICAKNYA UDAH CABUT.
en: I am, if the lizard’s really gone.

source: KENAPA NGGAK KAMU BANGUNIN?!!
en: why didn’t you wake me up?!

source: HEHEHE…BIARIN MASUK DULU DONG, NANTI GUE JELASIN…
en: hahaha... just let me in first, and I’ll explain why later.

source: DULUAN DULU
en: be off. Have a safe

source: KERJANYA...
en: do it.

source: BISA, MAMA HARUS
en: I’m going to melbourne

source: MAMA SAMA
en: you and mom

source: SKRIPSI SAYA HARUS
en: because I’ve got

source: NGGAK TELAT BISA
en: I would be

source: SAMA DIA...
en: again.

source: KARENA SAYA JENUH
en: I was bored

source: DIA NGERTI
en: understand,

source: ANAK KELAS 3,
en: had started it first,

source: SAMA SATU HAL...
en: on one thing.

source: SIH BU...
en: 30 minutes.

source: PUN AKAN BERBEDA!
en: the full experience!

source: Maya pengen ngerjain topik skripsi yang Maya suka.
en: I want to write a thesis on a topic that interests me.

source: SITUASI LAPANGAN.
en: field observation first.

source: Yaelah kirain ke mana taunya di sini-sini aja.
en: huff... of course he’d be here.

source: KAMU BAHAS
en: to choose for your thesis

source: Cepet banget ngilangnya…
en: I can’t find him.

source: NAMBAHIN
en: things

source: tapi karena kamu simpen terus, jadinya ngeganjel di kamu, bener nggak?
en: something that has always been bottling up inside you.

source: nanti nggak wisuda tahun ini loh?!!
en: if that’s the case, you won’t be able to graduate this year!

source: JADI KALO REWEL,
en: so if she acts up,

source: APA, APA?!
en: what is that?

source: JADI HARUS
en: so,

source: GERBANG.
en: by the gate.

source: LO HARUSNYA
en: you need

source: NATHAN, TRUS
en: telling nathan

source: TERUUSSS..
en: and...

source: HAHAHA...
en: it’s pretty far

source: SEMENTARA GUE LEBIH SERING KE GERBANG DEPAN.
en: while I prefer to use the front one.

source: TOLONG APA?
en: need, ma’am?

source: Masih nggak diangkat…
en: no answer...

source: JUGA ANAK PEDAL.
en: the members of pedal.

source: …sekarang aja kali ya…?
en: should I do it now?

source: SEKARANG SATU
en: even the whole

source: NANGKEP
en: a train

source: BOLEH DATENG
en: is coming up.

source: lhuiyo lali ac ne rusak...
en: oh, I forgot to tell you that it’s broken.

source: NGGAK, NANTI SAYA MALAH NGGAK SELESAI BACA JURNAL YANG INI.
en: no, I don’t want it to take my attention away from this journal.

source: TERASA KURANG,
en: it won’t be sufficient.

source: TRUS DIA IKUTAN
en: then he just came along.

source: KAMU BISA LEBIH
en: you’d be able to figure out

source: HARUS BROWSING
en: looking for

source: TAPI TERNYATA...
en: but

source: TAPI SIAP-SIAP
en: But I guess there’s no harm

source: ADUUH...
en: jeez...

source: yang kami
en: and

source: KEPUTUSANNYA.
en: her decision.

source: IYA JUGA...
en: huff...

source: SETELAH PEDAL BUBAR?
en: what happened after pedal was disbanded?

source: ibu sarankan, sebaiknya kamu mengulang dan mencari topik baru yang emang kamu suka.
en: I think it would be best for you to start over and pick a thesis topic that you are passionate about.

source: BOHONGI SAYA,
en: please tell me the truth.

source: TAPI PAS
en: they got caught

source: KITA KE STUDIO DP DULU YA, ABIS ITU MUNGKIN KE BENGKEL…
en: first, let’s make our way to the studio, and then onto the workshop.

source: BERPACARAN KARENA MENGISI KEKOSONGAN,
en: we get into a romantic relationship to fill the void in our lives,

source: I don't care, gue gak mau disetirin sama orang yang lagi mental breakdown.
en: I don’t care! I don’t want to ride shotgun while an unstable person like you takes the wheel.

source: Suatu Hari
en: One day,

source: PHOTOBOOTH!!
en: a photo booth!

source: ah... udah ras, jangan pikirin itu, pikirin t.a, pikirin yang lebih penting, pikirin hal yang nggak beres di dalam diri lo....
en: argh... stop it! don’t even think about it. you should consider your final project! you’d better think about more crucial matters and things you haven’t accomplished yet!

source: selama ini
en: had always thought

source: BAHAYA LHO
en: I’d be too worried

source: KENANG
en: as

source: Kalo gue kabur gak bawa duit bokap gue, kayaknya gue nggak bakal dicariin sampe segininya kali ya?
en: had I run away without his money, he wouldn’t have gone this far just to find me.

source: AAAKHH!!!
en: arghhh!!!

source: Cerita ini adalah fiktif belaka,
en: this is a work of fiction

source: HHH… IYA SIH JORDAN BENER INI URUSAN DIA…
en: he’s totally right. it’s none of my business...

source: DIA DEMAM, JADI
en: a fever...

source: SESUATU DI
en: with your

source: CEKREK!
en: click

source: KASIH YA!
en: you!

source: Atasan kalian bilang ke kalian nggak sih?!
en: haven’t your manager told you about this?!

source: Oooh… Tapi kenapa kamu sampai beli buku ya, nak?
en: I see... but, did you really have to buy the book?

source: KE GURU, MEREKA
en: to report it

source: DIA JUGA BILANG
en: She said

source: UM… YA… SAYA BUKAN ORANG YANG TEPAT KAMU MINTAI PENDAPAT, KARENA SAYA JUGA LAGI BERADA DI FASE YANG KAYAK KAMU…
en: um... I’m not sure if I’m the best person to answer your question because I’ve been through the same thing.

source: UDAH NGGAK ADA 'KAN?
en: you sure it’s really gone?

source: PRIORITASNYA,
en: her priority,

source: Kenapa gue nggak bisa mengabaikan aja sampai dia hilang?
en: why can’t I just ignore them until they disappear?

source: JANGAN
en: sir,

source: DAN DI JURUSAN YANG
en: that I really

source: IYA, BU...
en: yes, I am.

source: JAM 6, PARAH LU MOLOR MAGHRIB PAMALI NJIR.
en: it’s 6 PM. you were sound asleep.

source: LAGI SKRIPSI
en: she’s working

source: Gua dulu juga ngelakuin hal yang sama ke Maya, nggak pernah ngabarin dia, gua menghilang dari Maya, gua nggak ngejelasin apa-apa ke Maya.
en: I did the same thing to maya. I didn’t contact her, I avoided her, and I didn’t give her any explanation.

source: EH… IYA… KENAPA FOTO INI BISA ADA DI KAMAR SAYA…?!
en: wait... why is this picture in my room?!

source: episode 54 Memulai Dari Awal
en: episode 54 start from scratch

source: IYA SORI,
en: yeah,

source: Keren juga julukannya 'buronan keluarga'.
en: hehehe... being called a fugitive is kinda cool.

source: ..KOWAI..
en: how creepy...

source: Gue lagi nggak mau berantem ya, tapi lo liat Radi nggak?
en: I’ve got no time to quarrel, but have you seen radi?

source: MAMANYA...
en: mom...

source: NGGAK TAU!!
en: god knows!

source: PEDAL JUGA
en: one of the members

source: TADINYA SIH, HAHAHA, TAPI KAYAKNYA JELEK YA?!
en: I thought about presenting this, haha. but I didn’t like it.

source: LARAS WAKTU NYARI
en: when I was

source: TRUS LO MAU KAYAK GINI TERUS SAMPE KITTY BENERAN NGEGEDOR RUMAH GUE NYARIIN LO?
en: and you got here just in time for him to come pounding on my door and search for you.

source: NANYANYA
en: have asked you

source: PULANG MAYA
en: he should’ve told maya

source: aku rasa... kamu harus memastikan lagi ke radi soal perasaan kamu.
en: I think... you should sort out your feelings towards Radi.

source: GUE SIAP-SIAP DULU YA, LO TUNGGU DI LUAR.
en: I’ll change first, so wait outside for me.

source: Di saat yang sama, gue diemin lu demi mempertahankan perasaan gua.
en: at the same time, I avoided you to keep my feelings for her.

source: ZRAASSHH
en: shaaaaa

source: BIASANYA LO
en: I thought

source: Hj.
en: chef

source: ZRRRT
en: brrr

source: BADANNYA
en: I guess her fever

source: KAYAKNYA!
en: place!

source: JADI LARAS NGGAK USAH MENGHAWATIRKAN HUBUNGAN SAYA DAN RADI…
en: so, laras... there’s nothing to worry about with me and radi.

source: LU PADA
en: haven’t you noticed

source: MEREKA ADA SESUATU YA?
en: they must be hiding something.

source: GUE NGGAK TAU MAU KEMANA,
en: I didn’t know what I had to do in life.

source: Perasaan itu… nggak pernah bisa gua ukur Ras, satu-satunya cara buat gua adalah bertahan sama perasaan yang sama.
en: and... I couldn’t fully understand those feelings, laras. the only option for me was to keep the feelings that I had.

source: LOH, DAN?!
en: wait...

source: ABIS PUTUS
en: to be heartbroken.

source: plak!
en: slap

source: NGGAK BERES
en: happened

source: JEPANG BU,
en: ma’am.

source: HAHAHA… TUMBEN BANGET LARAS KE STUDIO KITA…
en: it’s so rare to see laras here in our studio.

source: KALO GITU KAYAK TUMPUKAN KARYA KERAMIK KECIL-KECIL DI POJOK STUDIO KERAMIK ITU YA?!!
en: then it must be like a collection of mini ceramic works in the corner of the ceramic workshop, right?

source: ABIS TAU SOAL FOTO TADI… DIA MENDADAK JADI KAYAK GINI…
en: after the photo incident, she’s suddenly become like this...

source: DALAM WAKTU YANG
en: some

source: YANG BOLEH BULLY
en: any of my classmates

source: kok kamu bisa tenang gitu sih ngomongnyaaa?!!!
en: why are you so calm about this?!

source: DIA.
en: like him.

source: BISA-BISANYA
en: I can’t believe

source: PEDAL KATA
en: about pedal

source: Hehehe…
en: hahaha...

source: CEPET
en: let’s

source: SAMA ANAK SAYA
en: between

source: GITU LOH WALAUPUN
en: considering

source: IBU BANYAK,
en: with me.

source: APA-APA...
en: ma’am.

source: MAYA, WALAUPUN
en: no mater

source: SEBENTAR AJA
en: could you stay,

source: Dan gua susah payah benerin itu semua demi Maya.
en: I worked really hard to fix everything for her sake.

source: BIASA.
en: down.

source: KENAPA BINTANG MALAH MAKIN SUSAH DIHUBUNGI SIH…?
en: why is it even more difficult to get a hold of bintang these days?

source: Ah sudahlah…
en: forget it.

source: DAN
en: and

source: Kamu benar-benar nggak mau kasih saya waktu untuk membenahi diri saya sendiri?
en: you really don’t want to give me time to mend and improve myself?

source: Di suasana yang sama kayak gini, setelah kejadian gue nyatain perasaan gue ke lo di café waktu itu, lo nggak pernah mau ngeliat gue.
en: after I confessed my feelings towards you at the cafe, you haven’t looked at me once. even now you don’t want to look at me.

source: HARUS APA YA…
en: what do I do?

source: KATA RADI,
en: he wasn’t

source: tap tap TAP
en: step step step

source: LAGIAN SAYA BIMBINGANNYA JAM 1, JADI BISA NYEMPETIN LIAT!!!
en: also, I have a meeting with my advisor at 1, so I can go to your thesis defense first.

source: URUSAN TUGAS
en: about

source: Gua sama Maya udah selesai.
en: maya and I... are over.

source: KAK AIS MAU
en: I’m gonna

source: iya ma, nanti ya...
en: sure, mom.

source: …INI… APA SIH… SAYA NGGAK NGERTI…
en: what is this? I don’t get it.

source: SINYAL ATAU
en: to cellular service too,

source: kamu selalu terbiasa bekerja sendiri, ini bikin ibu khawatir, bagaimana nasib kamu setelah lulus nanti?
en: you’re too comfortable working by yourself. I’m worried about you. what are you gonna do after you graduate?

source: loh...?
en: huh?

source: LO DARI KEMALANGAN
en: from harm

source: Bagi mereka, gue cuma aset aja, yang dikeluarin sewaktu-waktu kalo timingnya udah tepat.
en: for them, I was just an asset that would be brought up when the time was right.

source: LAPANGAN?!
en: observation?!

source: DEPAN, INI SAYA
en: but now that

source: SEMESTER
en: what semester

source: MAKASIH UDAH MAU BANTU GUE, TAPI KALO LO SENDIRI MASIH PUNYA MASALAH, TOLONG KELARIN DULU MASALAH LO.
en: I’m glad you want to help me, but I’d rather you solve your own problems before you try to help me.

source: HAAAAAI~
en: hellooo!

source: maya makan dulu ya, kak ais abis beli bakso tadi.
en: would you like to eat? I bought some meatballs.

source: (…ORANG ANEH…)
en: (what a weirdo!)

source: HAMPIR MIRIP
en: you’re just like

source: Apa lu harus sedingin ini sama gua?
en: do you really have to treat me like this, maya?

source: KAYA KAYAK
en: rich boy
